# Pandasüêº

In [42]:
import pandas as pd # pd estamos apelidando

# DataFrame

In [43]:
dados = {
    "Nome": ["Alice", "Bob", "Carlos"],
    "Idade": [25, 30, 22],
    "Cidade": ["S√£o Paulo", "Rio de Janeiro", "Belo Horizonte"]
}



dtf = pd.DataFrame(dados)
display(dtf)
# vendo a dimens√£o
print(f"Essa tabela tem {dtf.ndim} dimens√µes")

     Nome  Idade          Cidade
0   Alice     25       S√£o Paulo
1     Bob     30  Rio de Janeiro
2  Carlos     22  Belo Horizonte

Essa tabela tem 2 dimens√µes

## Par√¢metros  do DataFrame(data, index, columns, dtype)

## Explorando o par√¢metro data
*    Para o dataframe o parametro **data** pode receber varios tipos como por exemplo:
        * Lista
        * dicionario
        * DataFrame existente tamb√©m

## Exemplo com lista

In [44]:
lista = ["Paulo", "Sandro", "Frederico"]
dtf2 = pd.DataFrame(lista, columns = ["Nomes"])
dtf2

       Nomes
0      Paulo
1     Sandro
2  Frederico

## Exemplo com Dicion√°rio

In [45]:
dict = {
    "Nomes":lista, # Praticamente so peguei os valores que est√£o na variavel lista
    "Idades":[12,20,20]
}

dft3 = pd.DataFrame(dict)
dft3

       Nomes  Idades
0      Paulo      12
1     Sandro      20
2  Frederico      20

## Exemplo com um DataFrame existente

In [46]:
dft4 = pd.DataFrame(dft3)
dft4 # resultado

       Nomes  Idades
0      Paulo      12
1     Sandro      20
2  Frederico      20

# Atributo index
*   Ela serve para aceder ou mudar os "ids" de uma linha inteira onde ela pode receber lista ou numeros

### Sintaxe: index = [srings] or index = [numbers]

In [47]:
# exemplo com string:

dados_index = pd.DataFrame(dados, index = ["a", "b", "c"])
print(dados_index)

     Nome  Idade          Cidade
a   Alice     25       S√£o Paulo
b     Bob     30  Rio de Janeiro
c  Carlos     22  Belo Horizonte

In [48]:
# exemplo com numeros
dados_index2 = pd.DataFrame(dados, index = [10, 20, 30])
print(dados_index2)

      Nome  Idade          Cidade
10   Alice     25       S√£o Paulo
20     Bob     30  Rio de Janeiro
30  Carlos     22  Belo Horizonte

# Columns
* recebe uma string ou uma lista de strings que definem os r√≥tulos das colunas.

In [49]:
idades = [19,20,23,11]
nomes = ["Jo√£o", "Maria", "Pedro", "Ana"]
curso = ["Engenharia", "Administra√ß√£o", "Direito", "Medicina"]

dados = list(zip(nomes, idades, curso))
print(dados)
dft5 = pd.DataFrame(dados, columns = ["Nomes", "Idades", "Curso"])
dft5

[('Jo√£o', 19, 'Engenharia'), ('Maria', 20, 'Administra√ß√£o'), ('Pedro', 23, 'Direito'), ('Ana', 11, 'Medicina')]

   Nomes  Idades          Curso
0   Jo√£o      19     Engenharia
1  Maria      20  Administra√ß√£o
2  Pedro      23        Direito
3    Ana      11       Medicina

In [50]:
# Criando uma outra coluna
lista_compras = ["Arroz", "Feij√£o", "Macarr√£o", "Carne"]
quantidade_compras = [1,2,3,4]
preco = [500,1500,400,2000]
dados_compras = list(zip(lista_compras, quantidade_compras, preco))
dft6 = pd.DataFrame(dados_compras, columns = ["Produtos", "Quantidade", "Pre√ßo (kwzs)"])
dft6

   Produtos  Quantidade  Pre√ßo (kwzs)
0     Arroz           1           500
1    Feij√£o           2          1500
2  Macarr√£o           3           400
3     Carne           4          2000

In [51]:
dft5["Turma"] = ["A", "B", "C", "D"] # adicionando uma nova coluna.
dft5

   Nomes  Idades          Curso Turma
0   Jo√£o      19     Engenharia     A
1  Maria      20  Administra√ß√£o     B
2  Pedro      23        Direito     C
3    Ana      11       Medicina     D

## Dtype

*   recebe um tipo de dados com intuito de for√ßar a convers√£o do tipo de dados do DataFrame. Por padr√£o, esse par√¢metro recebe valor None e os tipos dos dados s√£o inferidos.

In [52]:
idades = dtf.Idade.values
dft7 = pd.DataFrame(idades, columns = ["Idades"], dtype = float)
dft7

   Idades
0    25.0
1    30.0
2    22.0

In [82]:
produtos = {
    "produtos": ["34.4", 45, 33.01 ,2]
}
pdt = pd.DataFrame(produtos, dtype = float)
pdt

   produtos
0     34.40
1     45.00
2     33.01
3      2.00